Repository: TahhanCoding/Azkar-Fold
Catalog: Azkar Fold/Azkar Fold/Resources/Localizable.xcstrings
Source language: en
Languages: ar

# app.name
source: Azkar Fold
ar: مطوية الأذكار

# app.tagline
source: Your Daily Islamic Remembrance
ar: ذكرك الإسلامي اليومي

# app.version
source: Version %@
ar: الإصدار %@

# azkary.counter_title
source: Zekr Counter
ar: عدّاد الذكر

# azkary.create
source: Create
ar: إنشاء

# azkary.create_button
source: Create Zekr
ar: إنشاء ذكر

# azkary.create_new
source: Create New Zekr
ar: إنشاء ذكر جديد

# azkary.create_title
source: Create Zekr
ar: إنشاء ذكر

# azkary.delete_confirm_message
source: Are you sure you want to delete this Zekr?
ar: هل أنت متأكد أنك تريد حذف هذا الذكر؟

# azkary.delete_confirm_title
source: Confirm Deletion
ar: تأكيد الحذف

# azkary.delete_zekr_message
source: Are you sure you want to delete this zekr? This action cannot be undone.
ar: هل أنت متأكد أنك تريد حذف هذا الذكر؟ لا يمكن التراجع عن هذا الإجراء.

# azkary.delete_zekr_title
source: Delete Zekr
ar: حذف الذكر

# azkary.empty_alert_message
source: Please enter some text for your Zekr.
ar: يرجى إدخال نص لذكرك.

# azkary.empty_alert_title
source: Empty Zekr
ar: ذكر فارغ

# azkary.empty_subtitle
source: Tap the Create button to start your first Zekr
ar: اضغط على زر الإنشاء لبدء أول ذكر لك

# azkary.empty_title
source: No custom Azkar created yet
ar: لم يتم إنشاء أذكار مخصصة بعد

# azkary.last_updated
source: Last updated: %@
ar: آخر تحديث: %@

# azkary.not_found
source: Zekr not found
ar: لم يُعثر على الذكر

# azkary.reset
source: Reset
ar: إعادة تعيين

# azkary.reset_confirm_message
source: Are you sure you want to reset the counter to 0?
ar: هل أنت متأكد أنك تريد إعادة تعيين العداد إلى 0؟

# azkary.reset_title
source: Reset Counter
ar: إعادة ضبط العداد

# azkary.tap_to_count
source: Tap to count
ar: اضغط للعد

# azkary.title
source: Azkary
ar: أذكاري

# common.apply
source: Apply
ar: تطبيق

# common.cancel
source: Cancel
ar: إلغاء

# common.copy_message
source: Copy Message
ar: نسخ الرسالة

# common.create
source: Create
ar: إنشاء

# common.delete
source: Delete
ar: حذف

# common.done
source: Done
ar: تم

# common.edit
source: Edit
ar: تعديل

# common.error
source: Error
ar: خطأ

# common.later
source: Later
ar: لاحقًا

# common.ok
source: OK
ar: موافق

# common.preparing
source: Preparing...
ar: جارٍ التحضير...

# common.save
source: Save
ar: حفظ

# common.send
source: Send
ar: إرسال

# common.share
source: Share
ar: مشاركة

# common.update
source: Update
ar: تحديث

# hint.dim.message
source: Screen is dimmed for comfortable counting in dark environments. Tap anywhere to count, long press to exit.
ar: تم تعتيم الشاشة لعدٍّ مريح في البيئات المظلمة. اضغط في أي مكان للعد، واضغط مطوّلًا للخروج.

# hint.dim.title
source: Dim mode activated
ar: تم تفعيل وضع التعتيم

# hint.mode.message
source: Long press on the zekr card to switch between Simple and Full reading modes.
ar: اضغط مطوّلًا على بطاقة الذكر للتبديل بين وضعي القراءة المبسّط والكامل.

# hint.mode.title
source: Simple & Full mode
ar: وضع المبسّط والكامل

# legal.last_updated
source: Last updated: %@
ar: آخر تحديث: %@

# legal.last_updated_date
source: July 7, 2026
ar: ٧ يوليو ٢٠٢٦

# legal.privacy_title
source: Privacy Policy
ar: سياسة الخصوصية

# legal.terms_title
source: Terms of Service
ar: شروط الخدمة

# prayer.coming_soon
source: Coming soon
ar: قريباً

# prayer.countdown
source: Next in %@
ar: التالي خلال %@

# prayer.location_makkah
source: Makkah
ar: مكة المكرمة

# prayer.period.asr
source: Asr
ar: العصر

# prayer.period.between
source: Between
ar: بين الصلوات

# prayer.period.dhuhr
source: Dhuhr
ar: الظهر

# prayer.period.fajr
source: Fajr
ar: الفجر

# prayer.period.isha
source: Isha
ar: العشاء

# prayer.period.maghrib
source: Maghrib
ar: المغرب

# prayer.period.shuruq
source: Sunrise
ar: الشروق

# prayer.subtitle_makkah
source: Makkah · 10 Jul 2026 (temporary)
ar: مكة · ١٠ يوليو ٢٠٢٦ (مؤقت)

# settings.actions
source: Actions
ar: الإجراءات

# settings.contact_support
source: Contact Support
ar: تواصل مع الدعم

# settings.developer_dua
source: May Allah forgive the developer and his parents
ar: غفر الله للمطور ولوالديه

# settings.language
source: Language
ar: اللغة

# settings.language.arabic
source: Arabic
ar: العربية

# settings.language.english
source: English
ar: الإنجليزية

# settings.language.subtitle
source: Choose app display language
ar: اختر لغة عرض التطبيق

# settings.legal
source: Legal
ar: قانوني

# settings.preferences
source: Preferences
ar: التفضيلات

# settings.privacy
source: Privacy Policy
ar: سياسة الخصوصية

# settings.rate
source: Rate This App
ar: قيّم هذا التطبيق

# settings.share_friends
source: Share With Friends
ar: شارك مع الأصدقاء

# settings.sunnah_manager
source: Sunnah Zekr Manager
ar: مدير أذكار السنة

# settings.sunnah_manager.subtitle
source: Customize reading experience
ar: تخصيص تجربة القراءة

# settings.tabs
source: Tabs
ar: التبويبات

# settings.tabs.subtitle
source: Show, arrange, and choose the startup tab
ar: إظهار التبويبات وترتيبها والتاب الافتراضي

# settings.terms
source: Terms of Service
ar: شروط الخدمة

# settings.theme_manager
source: Theme Manager
ar: مدير السمات

# settings.theme_manager.subtitle
source: Customize app colors and themes
ar: تخصيص ألوان التطبيق والسمات

# settings.title
source: Settings
ar: الإعدادات

# share.app_message
source: Check out Azkar Fold - Your Islamic Remembrance Companion!
ar: جرّب مطوية الأذكار - رفيقك في الذكر الإسلامي!

# sunnah_settings.3d_effects
source: 3D Effects
ar: تأثيرات ثلاثية الأبعاد

# sunnah_settings.arabic_only
source: Arabic Only
ar: العربية فقط

# sunnah_settings.display_settings
source: Display Settings
ar: إعدادات العرض

# sunnah_settings.enable_3d
source: Enable 3D Effects
ar: تفعيل التأثيرات ثلاثية الأبعاد

# sunnah_settings.full
source: Full
ar: كامل

# sunnah_settings.initial_view
source: Initial View Mode
ar: وضع العرض الافتراضي

# sunnah_settings.secondary_language
source: Secondary Language
ar: اللغة الثانوية

# sunnah_settings.simple
source: Simple
ar: مبسّط

# sunnah.arabic
source: Arabic
ar: عربي

# sunnah.bless
source: Bless
ar: الفضل

# sunnah.bless_lang
source: Bless %@
ar: الفضل %@

# sunnah.category.evening
source: Evening Azkar
ar: أذكار المساء

# sunnah.category.morning
source: Morning Azkar
ar: أذكار الصباح

# sunnah.category.prayer
source: After Prayer Azkar
ar: أذكار بعد الصلاة

# sunnah.category.sleeping
source: Before Sleeping Azkar
ar: أذكار قبل النوم

# sunnah.category.wakeup
source: Waking up Azkar
ar: أذكار الاستيقاظ

# sunnah.completed
source: Completed
ar: مكتمل

# sunnah.completed_category
source: You have completed all Azkar for the %@ category.
ar: لقد أكملت جميع أذكار فئة %@.

# sunnah.congratulations
source: Congratulations!
ar: تهانينا!

# sunnah.daily_title
source: Daily Sunnah Azkar
ar: أذكار السنة اليومية

# sunnah.load_failed
source: Failed to load %@: %@
ar: فشل تحميل %@: %@

# sunnah.next
source: Next
ar: التالي

# sunnah.no_categories
source: No Sunnah categories selected. Tap 'Edit' to choose categories.
ar: لم يتم اختيار فئات السنة. اضغط على «تعديل» لاختيار الفئات.

# sunnah.not_completed
source: Not completed yet
ar: لم يكتمل بعد

# sunnah.previous
source: Previous
ar: السابق

# sunnah.progress_of
source: %1$ld of %2$ld
ar: %1$ld من %2$ld

# sunnah.share_failed
source: Couldn't prepare the image. Please try again.
ar: تعذّر إعداد الصورة. يرجى المحاولة مرة أخرى.

# sunnah.share_nothing
source: Nothing to share for the current view.
ar: لا يوجد ما يُشارَك في العرض الحالي.

# sunnah.share_save_failed
source: Failed to save image to Photos.
ar: فشل حفظ الصورة في الصور.

# sunnah.share_saved
source: Image saved to Photos successfully!
ar: تم حفظ الصورة في الصور بنجاح!

# sunnah.source
source: Source
ar: المصدر

# sunnah.source_lang
source: Source %@
ar: المصدر %@

# support.adding
source: Adding attachment...
ar: جارٍ إضافة المرفق...

# support.attachment_error
source: Attachment Error
ar: خطأ في المرفق

# support.attachments
source: Attachments
ar: المرفقات

# support.copied_message
source: Your message was copied. You can paste it into any Mail app.
ar: تم نسخ رسالتك. يمكنك لصقها في أي تطبيق بريد.

# support.copied_title
source: Copied
ar: تم النسخ

# support.error.failed_to_load
source: The attachment could not be loaded.
ar: تعذر تحميل المرفق.

# support.error.file_too_large
source: Attachments must be %d MB or smaller.
ar: يجب ألا يتجاوز حجم المرفقات %d ميجابايت.

# support.error.unreadable_file
source: The selected file could not be read.
ar: تعذر قراءة الملف المحدد.

# support.failed_message
source: Mail could not send your message. Please try again.
ar: تعذّر على البريد إرسال رسالتك. يرجى المحاولة مرة أخرى.

# support.failed_title
source: Send Failed
ar: فشل الإرسال

# support.file
source: File
ar: ملف

# support.intro
source: Describe your issue or feedback. You can attach images, videos, or files.
ar: صِف مشكلتك أو ملاحظاتك. يمكنك إرفاق صور أو فيديوهات أو ملفات.

# support.mail_body.app
source: App: %@
ar: التطبيق: %@

# support.mail_body.device
source: Device: %@
ar: الجهاز: %@

# support.mail_body.version
source: Version: %@
ar: الإصدار: %@

# support.mail_unavailable
source: Mail Unavailable
ar: البريد غير متاح

# support.mail_unavailable_message
source: Set up a Mail account on this device to send support requests from the app.
ar: أعدّ حساب بريد على هذا الجهاز لإرسال طلبات الدعم من التطبيق.

# support.message
source: Message
ar: الرسالة

# support.no_attachments
source: No attachments added.
ar: لم تُضَف مرفقات.

# support.photo_video
source: Photo or Video
ar: صورة أو فيديو

# support.saved_message
source: Your message was saved to Drafts in Mail.
ar: تم حفظ رسالتك في المسودات في البريد.

# support.saved_title
source: Message Saved
ar: تم حفظ الرسالة

# support.sent_message
source: Your support request was sent.
ar: تم إرسال طلب الدعم الخاص بك.

# support.sent_title
source: Message Sent
ar: تم إرسال الرسالة

# support.subject
source: Azkar Fold Support
ar: دعم مطوية الأذكار

# support.title
source: Contact Support
ar: تواصل مع الدعم

# tab_settings.hidden
source: Hidden
ar: مخفي

# tab_settings.order
source: Tab order
ar: ترتيب التبويبات

# tab_settings.order_hint
source: Drag to rearrange tabs in the tab bar
ar: اسحب لإعادة ترتيب التبويبات في الشريط السفلي

# tab_settings.show_prayer
source: Show Prayer tab
ar: إظهار تبويب الصلاة

# tab_settings.startup
source: On launch
ar: عند التشغيل

# tab_settings.startup_tab
source: Startup tab
ar: التبويب الافتراضي

# tab_settings.visibility
source: Visibility
ar: الظهور

# tab.azkary
source: Azkary
ar: أذكاري

# tab.prayer
source: Prayer
ar: الصلاة

# tab.settings
source: Settings
ar: الإعدادات

# tab.sunnah
source: Sunnah
ar: السنة

# theme.accent_color
source: Accent Color
ar: لون التمييز

# theme.background_color
source: Background Color
ar: لون الخلفية

# theme.background_pattern
source: Background Pattern
ar: نمط الخلفية

# theme.button_text_color
source: Button Text Color
ar: لون نص الزر

# theme.cannot_delete_default
source: Default themes cannot be deleted.
ar: لا يمكن حذف السمات الافتراضية.

# theme.card_background_color
source: Card Background
ar: خلفية البطاقة

# theme.color_preview
source: Preview
ar: معاينة

# theme.colors_section
source: Colors
ar: الألوان

# theme.create_title
source: New Theme
ar: سمة جديدة

# theme.current_theme
source: Current Theme
ar: السمة الحالية

# theme.custom_themes
source: Custom Themes
ar: السمات المخصصة

# theme.default
source: Default
ar: افتراضي

# theme.default_themes
source: Default Themes
ar: السمات الافتراضية

# theme.delete_message
source: Are you sure you want to delete this theme? This action cannot be undone.
ar: هل أنت متأكد أنك تريد حذف هذه السمة؟ لا يمكن التراجع عن هذا الإجراء.

# theme.delete_named_message
source: Are you sure you want to delete "%@"? This action cannot be undone.
ar: هل أنت متأكد أنك تريد حذف "%@"؟ لا يمكن التراجع عن هذا الإجراء.

# theme.delete_title
source: Delete Theme
ar: حذف السمة

# theme.duplicate
source: Duplicate
ar: نسخ

# theme.duplicate_name
source: %@ Copy
ar: %@ نسخة

# theme.edit_title
source: Edit Theme
ar: تعديل السمة

# theme.enter_name
source: Enter theme name
ar: أدخل اسم السمة

# theme.errors
source: Errors
ar: أخطاء

# theme.hex_code
source: Hex Code
ar: رمز HEX

# theme.manager_title
source: Theme Manager
ar: مدير السمات

# theme.name_section
source: Theme Name
ar: اسم السمة

# theme.new
source: New Theme
ar: سمة جديدة

# theme.new_default_name
source: My Custom Theme
ar: سمتي المخصصة

# theme.none
source: None
ar: بدون

# theme.preset_colors
source: Preset Colors
ar: ألوان جاهزة

# theme.preset.dark
source: Dark
ar: داكن

# theme.preset.default
source: Default
ar: افتراضي

# theme.preset.ocean
source: Ocean
ar: محيط

# theme.preset.sunset
source: Sunset
ar: غروب

# theme.preview_section
source: Preview
ar: معاينة

# theme.preview_title
source: Theme Preview
ar: معاينة السمة

# theme.preview.app_header
source: App Header
ar: رأس التطبيق

# theme.preview.buttons
source: Buttons
ar: الأزرار

# theme.preview.cards
source: Cards
ar: البطاقات

# theme.preview.detail
source: Detail
ar: تفاصيل

# theme.preview.label
source: Preview
ar: معاينة

# theme.preview.list_item
source: List item %d
ar: عنصر %d

# theme.preview.list_items
source: List Items
ar: عناصر القائمة

# theme.preview.primary_button
source: Primary Button
ar: زر أساسي

# theme.preview.sample_subtitle
source: Daily remembrance
ar: ذكر يومي

# theme.preview.secondary_button
source: Secondary Button
ar: زر ثانوي

# theme.preview.tab_bar
source: Tab Bar
ar: شريط التبويب

# theme.primary_color
source: Primary Color
ar: اللون الأساسي

# theme.secondary_color
source: Secondary Color
ar: اللون الثانوي

# theme.select
source: Select
ar: اختيار

# theme.select_color
source: Select Color
ar: اختر اللون

# theme.text_color
source: Text Color
ar: لون النص

# theme.view_full_preview
source: View Full Preview
ar: عرض المعاينة الكاملة

# update.available_message
source: A new version (%@) of Azkar Fold is available with new features and improvements.
ar: يتوفر إصدار جديد (%@) من مطوية الأذكار بميزات وتحسينات جديدة.

# update.available_title
source: Update Available
ar: تحديث متاح

source: Update Now
ar: حدّث الآن

# update.required_message
source: A new version of Azkar Fold is available. Please update to continue using the app.
ar: يتوفر إصدار جديد من مطوية الأذكار. يرجى التحديث لمتابعة استخدام التطبيق.

# update.required_title
source: Update Required
ar: التحديث مطلوب

# update.versions
source: Current: %@ • Required: %@
ar: الحالي: %@ • المطلوب: %@

# update.whats_new
source: What's New:
ar: ما الجديد:
